class BotTexts {
    constructor() {
        this.welcome = `Приветствуем тебя будущий маг 1С в нашем чат-боте,который тебе дан в помощники. Он поможет тебе подготовиться к встрече со своим наставником.
Рекомендуем пройти все уровни (кнопки), чтобы тебе – «маг» было легче постигать этот путь.
        `;
        this.company_info = `Мы рады, что ты решил заглянуть к нам. Наша компания занимается продажей продуктов 1С, обслуживанием программ и консультированием. 
Тебе здесь точно понравится.
        `;
        this.roadmap = `Ты на верном пути. 
Но для начала тебе нужно познакомиться с 1С по ближе\n
ссылка на видео: https://yandex.ru/video/preview/8027163445405549167
        `;
        this.employee_info = `В нашем штате работают консультанты, программисты, системные администраторы,  менеджеры, бухгалтеры.
        `;
        this.routine = `У нас есть праздники и маленькие фишки, которые дополняют нашу компанию – день рождения компании (2 июля), новый год, по пятницам совместный выезд на обед. 
Мы отмечаем день рождения каждого сотрудника.
        `;
        this.education = `Маг, когда ты станешь нашим штатным сотрудником, у тебя будет возможность проходить обучение за счёт компании.
Здорово, не правда ли?
        `;
        this.values = `1. Мы уважаем друг друга
2. К каждому клиенту у нас индивидуальный подход
3. Каждый сотрудник специалист в своей области и отвечает за неё
4. Мы помогаем друг другу
5. Мы любим шутить и немного расслабляемся на работе
`;
        this.dive = `Ты молодец, а теперь давай погрузимся в 1С ещё больше. Используй свой чек-лист подготовки и поэтапно изучай материалы. Чтобы тебе легче было усвоить новую информацию, дарим тебе несколько советов для эффективного усвоения материала.\n
Тебе необходимо выбрать чек-лист/задание в зависимости от того, в качестве какого специалиста (программиста/консультанта/системного администратора) ты проходишь практику
        `;
        this.meeting = `Поздравляем! Ты прошёл все уровни, но твоё обучение ещё не подошло к концу. И теперь ты готов к встрече со своим наставником. Он будет тебя обучать и ответит на все твои вопросы. Кто у тебя наставник, ты можешь уточнить у менеджера по развитию (Анастасия).
        `;
        this.present = `За все свои старания ты можешь получить подарок – *ручку с блокнотом*\\. Но для начала тебе нужно будет заполнить анкету\\. Свой подарок можешь забрать у менеджера по развитию \\(Анастасия\\)\\. 
Успехов тебе в постигании 1С\\!`;
        this.diary = `Теперь будущий маг, когда ты узнал немного о нас и нашей компании, ты получаешь чек-лист для практиканта. Распечатай его и заполни все пункты, которые ты уже сделал. Не теряй его, он тебе ещё пригодится! Также мы тебе выдаём дневник практиканта, который ты – усердный маг будешь заполнять на протяжении всех дней практики. Дневник можешь взять у менеджера по развитию – Анастасии.
        `;
    }
}
module.exports = new BotTexts();